import { CONFIG } from './config'

export const VALIDGUESSES = [
   'կոճակ',
  'շաբաթ',
  'խաղող',
  'ծաղիկ',
  'խաղալ',
  'առաջին',
  'գոցել',
  'ցեղեկ',
  'շապիկ',
  'չամիչ',
  'փողոց',
  'պարոն',
  'տափատ',
   'արկած',
  'նորէն',
  'խնձոր',
  'ուրիշ',
  'որեւէ',
  'կապիկ',
  'կամար',
  'ծիրան',
  'մոխիր',
  'աշուն',
  'կացին',
  'հիւլէ',
  'զօդել',
  'թուիլ',
  'առնակ',
  'պանան',
  'գնդակ',
  'ճաղատ',
  'բոպիկ',
  'գարին',
  'հաջել',
  'տակառ',
  'ռեհան',
]

if (CONFIG.normalization) {
  VALIDGUESSES.forEach(
    (val, i) => (VALIDGUESSES[i] = val.normalize(CONFIG.normalization))
  )
}
